Обработки/Reports/_РеестрКвалифицированныхИнвесторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РеестрКвалифицированныхИнвесторов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалифицированныйИнвестор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РеестрКвалифицированныхИнвесторов/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация 	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.Период  		= ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Структура = Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Подписант);
	Подписант = РаботаСОтчетами.ПолучитьКонтактноеЛицо(Структура);
		
КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	
	ВыбранноеЗначение = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОчистка(Элемент, СтандартнаяОбработка)
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоВсемПриИзменении(Элемент)
	
	Если ПоВсем = 0 Тогда
		Отчет.КвалифицированныйИнвестор = "";
		Элементы.КвалифицированныйИнвестор.Видимость = Ложь;
	Иначе
		Элементы.КвалифицированныйИнвестор.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
